In [1]:
import requests
import pandas as pd
import numpy as np
import sqlalchemy
import warnings
warnings.filterwarnings('ignore')

#### Extract New York Public Transit Data

In [2]:
ny = pd.read_csv('MTA_Monthly_Ridership___Traffic_Data__Beginning_January_2008.csv')
ny.head()

        Month Agency  Ridership
0  01/01/2008    MNR    6453734
1  02/01/2008    MNR    6144377
2  03/01/2008    MNR    6602280
3  04/01/2008    B&T   24900328
4  04/01/2008    MNR    6787480

In [3]:
ny.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 719 entries, 0 to 718
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Month      719 non-null    object
 1   Agency     719 non-null    object
 2   Ridership  719 non-null    int64
dtypes: int64(1), object(2)
memory usage: 17.0+ KB

In [4]:
ny.describe()

          Ridership
count  7.190000e+02
mean   2.202314e+07
std    3.045323e+07
min    1.967700e+04
25%    4.046874e+06
50%    7.450980e+06
75%    2.668388e+07
max    1.553157e+08

#### Transformation

Convert Month from object datatype to datetime datatype and extract month information and abbreviate month values as a string

In [5]:
from datetime import datetime
ny['date'] = pd.to_datetime(ny['Month'])
ny['month'] = ny['date'].dt.month
import calendar
ny['month'] = ny['month'].apply(lambda x: calendar.month_abbr[x])

Rename Agency and Ridership columns appropriately

In [6]:
ny = ny.rename( {'Ridership' : 'ridership_count', 'Agency' : 'transportation_type'}, axis = 1)

Add city column

In [7]:
ny['city'] = 'New York'

Filter only bus and metro transportation types

In [8]:
ny['transportation_type'].value_counts()

transportation_type
MNR       194
B&T       191
Bus        74
Subway     74
LIRR       62
AAR        62
SIR        62
Name: count, dtype: int64

In [9]:
df = ny['transportation_type'].isin( ['Bus', 'LIRR', 'MNR', 'SIR']) 
filtered = ny[df]
filtered.info()

<class 'pandas.core.frame.DataFrame'>
Index: 392 entries, 0 to 718
Data columns (total 6 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Month                392 non-null    object
 1   transportation_type  392 non-null    object
 2   ridership_count      392 non-null    int64
 3   date                 392 non-null    datetime64[ns]
 4   month                392 non-null    object
 5   city                 392 non-null    object
dtypes: datetime64[ns](1), int64(1), object(4)
memory usage: 21.4+ KB

Rename transportation types appropriately

In [10]:
filtered['transportation_type']= filtered['transportation_type'].map({'LIRR' : 'metro', 'MNR': 'metro', 'SIR': 'metro', 'Bus' : 'bus'})

Drop unecessary columns

In [11]:
ny_df = filtered.drop(columns = ['Month', 'date'], axis = 1)

Re-arrange the columns for legibility

In [12]:
column_order = ['month', 'city', 'transportation_type', 'ridership_count']
ny_df= ny_df.reindex(columns=column_order)
ny_df.head()

  month      city transportation_type  ridership_count
0   Jan  New York               metro          6453734
1   Feb  New York               metro          6144377
2   Mar  New York               metro          6602280
4   Apr  New York               metro          6787480
5   May  New York               metro          6840901

#### Extract Chicago Public Transit Data

In [13]:
cg = pd.read_csv('CTA_Ridership.csv')
cg.head()

  service_date day_type     bus  rail_boardings  total_rides
0   01/01/2001        U  297192          126455       423647
1   01/02/2001        W  780827          501952      1282779
2   01/03/2001        W  824923          536432      1361355
3   01/04/2001        W  870021          550011      1420032
4   01/05/2001        W  890426          557917      1448343

In [14]:
cg.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8553 entries, 0 to 8552
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   service_date    8553 non-null   object
 1   day_type        8553 non-null   object
 2   bus             8553 non-null   int64
 3   rail_boardings  8553 non-null   int64
 4   total_rides     8553 non-null   int64
dtypes: int64(3), object(2)
memory usage: 334.2+ KB

In [15]:
cg.describe()

                bus  rail_boardings   total_rides
count  8.553000e+03    8.553000e+03  8.553000e+03
mean   7.191226e+05    5.173370e+05  1.236460e+06
std    2.711641e+05    2.093643e+05  4.669212e+05
min    8.078300e+04    2.354400e+04  1.100470e+05
25%    4.645440e+05    3.278890e+05  8.038880e+05
50%    7.899440e+05    5.917420e+05  1.480866e+06
75%    9.641410e+05    6.979790e+05  1.636104e+06
max    1.211992e+06    1.146516e+06  2.049519e+06

#### Transformation

Convert Month from object datatype to datetime datatype and extract month information and abbreviate month values as a string

In [16]:
from datetime import datetime
cg['date'] = pd.to_datetime(cg['service_date'])
cg['month'] = cg['date'].dt.month
import calendar
cg['month'] = cg['month'].apply(lambda x: calendar.month_abbr[x])

Add city column

In [17]:
cg['city'] = 'Chicago'

Drop unecessary columns and separate rail and bus transportation types

In [18]:
cg_bus = cg.drop(columns = ['service_date','day_type','date','rail_boardings', 'total_rides'], axis = 1)

Rename bus column to ridership_count

In [19]:
cg_bus['transportation_type'] = 'bus'
cg_bus = cg_bus.rename({'bus' :'ridership_count'}, axis = 1)
cg_bus.head()

   ridership_count month     city transportation_type
0           297192   Jan  Chicago                 bus
1           780827   Jan  Chicago                 bus
2           824923   Jan  Chicago                 bus
3           870021   Jan  Chicago                 bus
4           890426   Jan  Chicago                 bus

In [20]:
cg_metro = cg.drop(columns = ['service_date','day_type','date','bus', 'total_rides'], axis = 1)

Rename rail boardings column to ridership_count

In [21]:
cg_metro['transportation_type'] = 'metro'
cg_metro = cg_metro.rename({'rail_boardings' :'ridership_count'}, axis = 1)
cg_metro.head()

   ridership_count month     city transportation_type
0           126455   Jan  Chicago               metro
1           501952   Jan  Chicago               metro
2           536432   Jan  Chicago               metro
3           550011   Jan  Chicago               metro
4           557917   Jan  Chicago               metro

Merge the 2 separated dataframes

In [22]:
cg_all = pd.concat([cg_bus, cg_metro], axis = 0)
cg_all.info()

<class 'pandas.core.frame.DataFrame'>
Index: 17106 entries, 0 to 8552
Data columns (total 4 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   ridership_count      17106 non-null  int64
 1   month                17106 non-null  object
 2   city                 17106 non-null  object
 3   transportation_type  17106 non-null  object
dtypes: int64(1), object(3)
memory usage: 668.2+ KB

Re-order the columns for legibility

In [23]:
column_order = ['month', 'city', 'transportation_type', 'ridership_count']
cg_df= cg_all.reindex(columns=column_order)
cg_df.head()

  month     city transportation_type  ridership_count
0   Jan  Chicago                 bus           297192
1   Jan  Chicago                 bus           780827
2   Jan  Chicago                 bus           824923
3   Jan  Chicago                 bus           870021
4   Jan  Chicago                 bus           890426

Merge both the New York and Chicago cities Public transit data

In [24]:
monthly_totals = pd.concat([ny_df, cg_df])

In [25]:
monthly_totals.info()

<class 'pandas.core.frame.DataFrame'>
Index: 17498 entries, 0 to 8552
Data columns (total 4 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   month                17498 non-null  object
 1   city                 17498 non-null  object
 2   transportation_type  17498 non-null  object
 3   ridership_count      17498 non-null  int64
dtypes: int64(1), object(3)
memory usage: 683.5+ KB

Load the dataframe into SQL database for further analysis

In [26]:
import psycopg2
from sqlalchemy import create_engine
#setup our credentials to connect to Postgres
user = 'postgres'
password = 'hellosql'
database = 'Monthly Totals'
host = 'localhost'
port = '5432'
#Create the connection string
connection_string = f'postgresql+psycopg2://{user}:{password}@{host}:{port}/{database}'
# create the engine
engine = create_engine(connection_string)
#load the extracted and transformed data into sql
monthly_totals.to_sql('monthly_totals', engine, index= False, if_exists= 'replace')
print("Data successfully loaded")

Data successfully loaded